# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
print("Введите трехзначное число: ")
i = int(input())
m = i
sum = 0
while i > 0:
    j = i % 10
    sum += j
    i = i/10
print(f'Сумма числа <{m}> - -> {int(sum)}')
