# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# *Пример:*

#     - [2, 3, 4, 5, 6] => [12, 15, 16];
#     - [2, 3, 5, 6] => [12, 15]

import random
n = int(input("Введите количество элементов в массиве: "))
m = []
for _ in range(n):
    m.append(random.randint(0, 5))
i = 0
new_list = []
while i <= (len(m)-1)//2:
    k = m[i]*m[len(m)-1-i]
    i += 1
    new_list.append(k)
print(f'Произведение пар чисел списка {m} => {new_list}')
