# Определить индексы элементов массива(списка),
# значения которых принадлежат заданному диапазону(т.е. не
# меньше заданного минимума и не больше заданного максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
#         0  1  2  3   4   5  6  7   8   9  10 11 12 13  14  15  16  17 18 19
# Вывод: [1, 9, 13, 14, 19]

import random
n = int(input("Введите количество элементов в массиве: "))
m = []
for _ in range(n):
    m.append(random.randint(-10, 10))
print(m)
min = int(input("Введите min: "))
max = int(input("Введите max: "))
i = 0
index_massive = []
while i < n:
    if m[i] >= min and m[i] <= max:
        index_massive.append(int(i))
    i += 1
print(index_massive)
